I'm also getting errors when the tests are run (these are related to this PR):

```
$ make testacc TESTARGS='-run=TestAccConnect_serial/RoutingProfile/queues\|TestAccConnect_serial/Queue/quickConnectIds' PKG=connect ACCTEST_PARALLELISM=1
==> Checking that code complies with gofmt requirements...
TF_ACC=1 go test ./internal/service/connect/... -v -count 1 -parallel 1  -run=TestAccConnect_serial/RoutingProfile/queues\|TestAccConnect_serial/Queue/quickConnectIds -timeout 180m
=== RUN   TestAccConnect_serial
=== PAUSE TestAccConnect_serial
=== CONT  TestAccConnect_serial
=== RUN   TestAccConnect_serial/RoutingProfile
=== RUN   TestAccConnect_serial/RoutingProfile/queues
    routing_profile_test.go:225: Step 1/7 error: After applying this test step, the plan was not empty.
        stdout:
        
        
        Terraform used the selected providers to generate the following execution
        plan. Resource actions are indicated with the following symbols:
          ~ update in-place
         <= read (data resources)
        
        Terraform will perform the following actions:
        
          # data.aws_connect_hours_of_operation.test will be read during apply
          # (config refers to values not yet known)
         <= data "aws_connect_hours_of_operation" "test"  {
              ~ arn                    = "arn:aws:connect:us-west-2:ACCOUNT-ID:instance/EXAMPLE-ID/operating-hours/EXAMPLE-ID" -> (known after apply)
              ~ config                 = [
                  - {
                      - day        = "FRIDAY"
                      - end_time   = [
                          - {
                              - hours   = 0
                              - minutes = 0
                            },
                        ]
                      - start_time = [
                          - {
                              - hours   = 0
                              - minutes = 0
                            },
                        ]
                    },
                  - {
                      - day        = "MONDAY"
                      - end_time   = [
                          - {
                              - hours   = 0
                              - minutes = 0
                            },
                        ]
                      - start_time = [
                          - {
                              - hours   = 0
                              - minutes = 0
                            },
                        ]
                    },
                  - {
                      - day        = "SATURDAY"
                      - end_time   = [
                          - {
                              - hours   = 0
                              - minutes = 0
                            },
                        ]
                      - start_time = [
                          - {
                              - hours   = 0
                              - minutes = 0
                            },
                        ]
                    },
                  - {
                      - day        = "SUNDAY"
                      - end_time   = [
                          - {
                              - hours   = 0
                              - minutes = 0
                            },
                        ]
                      - start_time = [
                          - {
                              - hours   = 0
                              - minutes = 0
                            },
                        ]
                    },
                  - {
                      - day        = "THURSDAY"
                      - end_time   = [
                          - {
                              - hours   = 0
                              - minutes = 0
                            },
                        ]
                      - start_time = [
                          - {
                              - hours   = 0
                              - minutes = 0
                            },
                        ]
                    },
                  - {
                      - day        = "TUESDAY"
                      - end_time   = [
                          - {
                              - hours   = 0
                              - minutes = 0
                            },
                        ]
                      - start_time = [
                          - {
                              - hours   = 0
                              - minutes = 0
                            },
                        ]
                    },
                  - {
                      - day        = "WEDNESDAY"
                      - end_time   = [
                          - {
                              - hours   = 0
                              - minutes = 0
                            },
                        ]
                      - start_time = [
                          - {
                              - hours   = 0
                              - minutes = 0
                            },
                        ]
                    },
                ] -> (known after apply)
              ~ description            = "Always open hours" -> (known after apply)
              ~ hours_of_operation_arn = "arn:aws:connect:us-west-2:ACCOUNT-ID:instance/EXAMPLE-ID/operating-hours/EXAMPLE-ID" -> (known after apply)
              ~ hours_of_operation_id  = "EXAMPLE-ID" -> (known after apply)
              ~ id                     = "EXAMPLE-ID" -> (known after apply)
                name                   = "Basic Hours"
              ~ tags                   = {} -> (known after apply)
              ~ time_zone              = "America/New_York" -> (known after apply)
                # (1 unchanged attribute hidden)
            }
        
          # aws_connect_instance.test will be updated in-place
          ~ resource "aws_connect_instance" "test" {
                id                               = "EXAMPLE-ID"
              ~ multi_party_conference_enabled   = true -> false
                # (12 unchanged attributes hidden)
            }
        
          # aws_connect_queue.default_outbound_queue will be updated in-place
          ~ resource "aws_connect_queue" "default_outbound_queue" {
              ~ hours_of_operation_id        = "EXAMPLE-ID" -> (known after apply)
                id                           = "EXAMPLE-ID"
                name                         = "EXAMPLE-NAME"
                # (8 unchanged attributes hidden)
            }
        
        Plan: 0 to add, 2 to change, 0 to destroy.
=== RUN   TestAccConnect_serial/Queue
=== RUN   TestAccConnect_serial/Queue/quickConnectIds
    queue_test.go:354: Step 1/7 error: After applying this test step, the plan was not empty.
        stdout:
        
        
        Terraform used the selected providers to generate the following execution
        plan. Resource actions are indicated with the following symbols:
          ~ update in-place
         <= read (data resources)
        
        Terraform will perform the following actions:
        
          # data.aws_connect_hours_of_operation.test will be read during apply
          # (config refers to values not yet known)
         <= data "aws_connect_hours_of_operation" "test"  {
              ~ arn                    = "arn:aws:connect:us-west-2:ACCOUNT-ID:instance/EXAMPLE-ID/operating-hours/EXAMPLE-ID" -> (known after apply)
              ~ config                 = [
                  - {
                      - day        = "FRIDAY"
                      - end_time   = [
                          - {
                              - hours   = 0
                              - minutes = 0
                            },
                        ]
                      - start_time = [
                          - {
                              - hours   = 0
                              - minutes = 0
                            },
                        ]
                    },
                  - {
                      - day        = "MONDAY"
                      - end_time   = [
                          - {
                              - hours   = 0
                              - minutes = 0
                            },
                        ]
                      - start_time = [
                          - {
                              - hours   = 0
                              - minutes = 0
                            },
                        ]
                    },
                  - {
                      - day        = "SATURDAY"
                      - end_time   = [
                          - {
                              - hours   = 0
                              - minutes = 0
                            },
                        ]
                      - start_time = [
                          - {
                              - hours   = 0
                              - minutes = 0
                            },
                        ]
                    },
                  - {
                      - day        = "SUNDAY"
                      - end_time   = [
                          - {
                              - hours   = 0
                              - minutes = 0
                            },
                        ]
                      - start_time = [
                          - {
                              - hours   = 0
                              - minutes = 0
                            },
                        ]
                    },
                  - {
                      - day        = "THURSDAY"
                      - end_time   = [
                          - {
                              - hours   = 0
                              - minutes = 0
                            },
                        ]
                      - start_time = [
                          - {
                              - hours   = 0
                              - minutes = 0
                            },
                        ]
                    },
                  - {
                      - day        = "TUESDAY"
                      - end_time   = [
                          - {
                              - hours   = 0
                              - minutes = 0
                            },
                        ]
                      - start_time = [
                          - {
                              - hours   = 0
                              - minutes = 0
                            },
                        ]
                    },
                  - {
                      - day        = "WEDNESDAY"
                      - end_time   = [
                          - {
                              - hours   = 0
                              - minutes = 0
                            },
                        ]
                      - start_time = [
                          - {
                              - hours   = 0
                              - minutes = 0
                            },
                        ]
                    },
                ] -> (known after apply)
              ~ description            = "Always open hours" -> (known after apply)
              ~ hours_of_operation_arn = "arn:aws:connect:us-west-2:ACCOUNT-ID:instance/EXAMPLE-ID/operating-hours/EXAMPLE-ID" -> (known after apply)
              ~ hours_of_operation_id  = "EXAMPLE-ID" -> (known after apply)
              ~ id                     = "EXAMPLE-ID" -> (known after apply)
                name                   = "Basic Hours"
              ~ tags                   = {} -> (known after apply)
              ~ time_zone              = "America/New_York" -> (known after apply)
                # (1 unchanged attribute hidden)
            }
        
          # aws_connect_instance.test will be updated in-place
          ~ resource "aws_connect_instance" "test" {
                id                               = "EXAMPLE-ID"
              ~ multi_party_conference_enabled   = true -> false
                # (12 unchanged attributes hidden)
            }
        
          # aws_connect_queue.test will be updated in-place
          ~ resource "aws_connect_queue" "test" {
              ~ hours_of_operation_id        = "EXAMPLE-ID" -> (known after apply)
                id                           = "EXAMPLE-ID"
                name                         = "EXAMPLE-NAME"
                tags                         = {
                    "Name" = "Test Queue"
                }
                # (8 unchanged attributes hidden)
            }
        
        Plan: 0 to add, 2 to change, 0 to destroy.
--- FAIL: TestAccConnect_serial (172.55s)
    --- FAIL: TestAccConnect_serial/RoutingProfile (87.28s)
        --- FAIL: TestAccConnect_serial/RoutingProfile/queues (87.28s)
    --- FAIL: TestAccConnect_serial/Queue (85.27s)
        --- FAIL: TestAccConnect_serial/Queue/quickConnectIds (85.27s)
FAIL
FAIL    github.com/hashicorp/terraform-provider-aws/internal/service/connect    172.661s
FAIL
make: *** [testacc] Error 1
```

Upon further investigation, I found that it had to do with the `multi_party_conference_enabled` argument of the `aws_connect_instance`. From the code, it is set to a default value of `false` but somehow when created, it's being created as `true`. To validate this hypothesis, for the tests above I tried setting `multi_party_conference_enabled` of the `aws_connect_instance` to `true` and the test cases pass:

```
$ make testacc TESTARGS='-run=TestAccConnect_serial/RoutingProfile/queues\|TestAccConnect_serial/Queue/quickConnectIds' PKG=connect ACCTEST_PARALLELISM=1
==> Checking that code complies with gofmt requirements...
TF_ACC=1 go test ./internal/service/connect/... -v -count 1 -parallel 1  -run=TestAccConnect_serial/RoutingProfile/queues\|TestAccConnect_serial/Queue/quickConnectIds -timeout 180m
=== RUN   TestAccConnect_serial
=== PAUSE TestAccConnect_serial
=== CONT  TestAccConnect_serial
=== RUN   TestAccConnect_serial/Queue
=== RUN   TestAccConnect_serial/Queue/quickConnectIds
=== RUN   TestAccConnect_serial/RoutingProfile
=== RUN   TestAccConnect_serial/RoutingProfile/queues
--- PASS: TestAccConnect_serial (343.79s)
    --- PASS: TestAccConnect_serial/Queue (170.45s)
        --- PASS: TestAccConnect_serial/Queue/quickConnectIds (170.45s)
    --- PASS: TestAccConnect_serial/RoutingProfile (173.34s)
        --- PASS: TestAccConnect_serial/RoutingProfile/queues (173.34s)
PASS
ok      github.com/hashicorp/terraform-provider-aws/internal/service/connect    343.892s
```

On a fresh Connect instance, I ran the `list-instance-attributes` CLI command and the `MULTI_PARTY_CONFERENCE` shows as `true` and not `false`.

```
aws connect list-instance-attributes --instance-id EXAMPLE-ID
{
    "Attributes": [
        {
            "AttributeType": "AUTO_RESOLVE_BEST_VOICES",
            "Value": "true"
        },
        {
            "AttributeType": "CONTACTFLOW_LOGS",
            "Value": "true"
        },
        {
            "AttributeType": "CONTACT_LENS",
            "Value": "true"
        },
        {
            "AttributeType": "EARLY_MEDIA",
            "Value": "true"
        },
        {
            "AttributeType": "ENHANCED_CONTACT_MONITORING",
            "Value": "true"
        },
        {
            "AttributeType": "INBOUND_CALLS",
            "Value": "true"
        },
        {
            "AttributeType": "MULTI_PARTY_CONFERENCE",
            "Value": "true"
        },
        {
            "AttributeType": "OUTBOUND_CALLS",
            "Value": "true"
        },
        {
            "AttributeType": "USE_CUSTOM_TTS_VOICES",
            "Value": "false"
        }
    ]
}
```

Proposed fix: change default of `multi_party_conference_enabled` to `true`. @ewbankkit, should I change this default in this PR or raise a new PR for it? Thanks! 

https://github.com/hashicorp/terraform-provider-aws/blob/5acce42995966be87de96072fb68f142718d8d0f/internal/service/connect/instance.go#L91-L95